app/controllers/reviews_controller.rb

	def create
	  #@movie = Movie.find(params[:movie_id])
	  @review = @movie.reviews.new(review_params)
	  if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "welcome"], ["created_at", Sat, 10 May 2014 09:03:25 UTC +00:00], ["movie_id", 5], ["name", "Test"], ["stars", 1], ["updated_at", Sat, 10 May 2014 09:03:25 UTC +00:00]]